Revit 2027 API
IFCExtrusionCreationData.GetLocalPlacement Method
 Gets the reference to the IfcLocalPlacement handle used when creating the extrusion.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCAnyHandle GetLocalPlacement()
Public Function GetLocalPlacement As IFCAnyHandle
public:
IFCAnyHandle^ GetLocalPlacement()
member GetLocalPlacement : unit -> IFCAnyHandle
Return Value
IFCAnyHandle
 The IfcLocalPlacement handle.
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace